# RebarTrimExtendData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarTrimExtendData Methods
RebarTrimExtendData Class See Also
---
The RebarTrimExtendData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddBarGeometry(IList<(Of <<'(Curve>)>>)) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| AddBarGeometry(CurveLoop) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| CanAddBarGeometry | Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise. |
| ClearAllAddedBarGeometry | This function will remove all bars geometry that were added by calling AddBarGeometry(). |
| CreateEndConstraint | Creates a constraint for the end handle of the rebar. This constraint will be set preferred after the API execution is finished successfully. |
| CreateStartConstraint | Creates a constraint for the start handle of the rebar. This constraint will be set preferred after the API execution is finished successfully. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAddedBarGeometry | Gets the added curves that will represent the bar at index barIndex. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetNumberOfBarGeometry | Gets the number of Bar Geometry that were added. |
| GetRebarUpdateCurvesData | Gets a class that contains information used as input and output for rebar free form calculation. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace